import pandas as pd

from config import PATH_TO_OPERATIONS
from src.reports import spending_by_category

df_transactions = pd.read_excel(PATH_TO_OPERATIONS)

def test_spending_by_category():
    assert spending_by_category(df_transactions, 'Аптеки', '08.2018') == '[{"Дата операции": "27.07.2018 22:39:41", "Дата платежа": "29.07.2018", "Номер карты": "*7197", "Статус": "OK", "Сумма операции": -140.0, "Валюта операции": "RUB", "Сумма платежа": -140.0, "Валюта платежа": "RUB", "Кэшбэк": NaN, "Категория": "Аптеки", "MCC": 5912.0, "Описание": "Аптечная сеть О3", "Бонусы (включая кэшбэк)": 2, "Округление на инвесткопилку": 0, "Сумма операции с округлением": 140.0}, {"Дата операции": "05.07.2018 14:22:26", "Дата платежа": "07.07.2018", "Номер карты": "*7197", "Статус": "OK", "Сумма операции": -215.5, "Валюта операции": "RUB", "Сумма платежа": -215.5, "Валюта платежа": "RUB", "Кэшбэк": NaN, "Категория": "Аптеки", "MCC": 5912.0, "Описание": "OOO Dobrodeya", "Бонусы (включая кэшбэк)": 4, "Округление на инвесткопилку": 0, "Сумма операции с округлением": 215.5}, {"Дата операции": "16.06.2018 00:02:18", "Дата платежа": "18.06.2018", "Номер карты": "*7197", "Статус": "OK", "Сумма операции": -481.0, "Валюта операции": "RUB", "Сумма платежа": -481.0, "Валюта платежа": "RUB", "Кэшбэк": NaN, "Категория": "Аптеки", "MCC": 5912.0, "Описание": "Apteka 7", "Бонусы (включая кэшбэк)": 9, "Округление на инвесткопилку": 0, "Сумма операции с округлением": 481.0}, {"Дата операции": "30.05.2018 22:40:00", "Дата платежа": "01.06.2018", "Номер карты": "*7197", "Статус": "OK", "Сумма операции": -45.0, "Валюта операции": "RUB", "Сумма платежа": -45.0, "Валюта платежа": "RUB", "Кэшбэк": NaN, "Категория": "Аптеки", "MCC": 5912.0, "Описание": "OOO Fialka Plyus", "Бонусы (включая кэшбэк)": 0, "Округление на инвесткопилку": 0, "Сумма операции с округлением": 45.0}, {"Дата операции": "14.05.2018 00:00:00", "Дата платежа": "15.05.2018", "Номер карты": "*7197", "Статус": "OK", "Сумма операции": -31.0, "Валюта операции": "TRY", "Сумма платежа": -461.99, "Валюта платежа": "RUB", "Кэшбэк": NaN, "Категория": "Аптеки", "MCC": 5912.0, "Описание": "Bercin  Eczanesi-Erdogan", "Бонусы (включая кэшбэк)": 9, "Округление на инвесткопилку": 0, "Сумма операции с округлением": 461.99}]'


def test_spending_by_category_2():
    assert spending_by_category(df_transactions, 'Аптеки') == '[]'
